## Production: iam
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 7 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                       NAME                                        |
|--------|-----------------------------------------------------------------------------------|
| add    | `aws_iam_policy.ai-answers-ssm-policy`                                            |
|        | `aws_iam_policy.ecr_deploy_policy[0]`                                             |
|        | `aws_iam_policy_attachment.ai-answers-ssm-policy`                                 |
|        | `aws_iam_role.ai-answers-ecs-role`                                                |
|        | `aws_iam_role_policy_attachment.ai-answers-ecs-policy`                            |
|        | `aws_iam_role_policy_attachment.ai_answers_release[0]`                            |
|        | `module.github_workflow_roles[0].aws_iam_role.this[&quot;ai-answers-ecr-deploy-role&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.ai-answers-ssm-policy will be created
  + resource "aws_iam_policy" "ai-answers-ssm-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for ai-answers production to access SSM parameters"
      + id               = (known after apply)
      + name             = "ai-answers-ssm-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParametersByPath",
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "mock_docdb_uri_arn",
                          + "",
                        ]
                      + Sid      = "AllowSSMParameterAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.ecr_deploy_policy[0] will be created
  + resource "aws_iam_policy" "ecr_deploy_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for GitHub Actions to deploy to ECR and update ECS"
      + id               = (known after apply)
      + name             = "ai-answers-ecr-deploy-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:GetAuthorizationToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ecs:UpdateService",
                          + "ecs:DescribeServices",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:ca-central-1:730335533085:service/ai-answers-prod-cluster/ai-answers-prod-app-service"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy_attachment.ai-answers-ssm-policy will be created
  + resource "aws_iam_policy_attachment" "ai-answers-ssm-policy" {
      + id         = (known after apply)
      + name       = "ai-answers-ssm-policy"
      + policy_arn = (known after apply)
      + roles      = [
          + "ai-answers-ecs-role",
        ]
    }

  # aws_iam_role.ai-answers-ecs-role will be created
  + resource "aws_iam_role" "ai-answers-ecs-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ai-answers-ecs-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ai-answers-ecs-policy will be created
  + resource "aws_iam_role_policy_attachment" "ai-answers-ecs-policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "ai-answers-ecs-role"
    }

  # aws_iam_role_policy_attachment.ai_answers_release[0] will be created
  + resource "aws_iam_role_policy_attachment" "ai_answers_release" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ai-answers-ecr-deploy-role"
    }

  # module.github_workflow_roles[0].aws_iam_role.this["ai-answers-ecr-deploy-role"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/ai-answers:ref:refs/tags/v*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::730335533085:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ai-answers-ecr-deploy-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ai-answers-ecs-policy_attachment = {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "ai-answers-ecs-role"
    }
  + iam_role_ai-answers-ecs-role_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr_deploy_policy[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.ai-answers-ecs-role"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
